Revit 2027 API
FabricationServiceButton.PaletteIndex Property
 The palette index for this button.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int PaletteIndex { get; }
Public ReadOnly Property PaletteIndex As Integer
	Get
public:
property int PaletteIndex {
	int get ();
}
member PaletteIndex : int with get
Property Value
Int32
See Also
Reference
FabricationServiceButton Class
Autodesk.Revit.DB Namespace